<a href="https://colab.research.google.com/github/JavariaAmber/python-project/blob/main/pandaslabipynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Read CSV file stored in Google Drive
from google.colab import drive # Import 'drive' module from the 'google.colab' library
drive.mount('/content/drive') # This mounts your Google Drive into the Colab virtual environment.

Mounted at /content/drive

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv.csv'
df = pd.read_csv(file_path)

print(df.head())

   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked predicted embarked
0   330911   7.8292   NaN        Q                  Q
1   363272   7.0000   NaN        S                  S
2   240276   9.6875   NaN        Q                  Q
3   315154   8.6625   NaN        S                  S
4  3101298  12.2875   NaN        S                  S

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Loan.csv'
df = pd.read_csv(file_path)

print(df.head())

    Loan_ID Gender Married Dependents     Education Self_Employed  \
0  LP001002   Male      No          0      Graduate            No
1  LP001003   Male     Yes          1      Graduate            No
2  LP001005   Male     Yes          0      Graduate           Yes
3  LP001006   Male     Yes          0  Not Graduate            No
4  LP001008   Male      No          0      Graduate            No

   ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0             5849                0.0         NaN             360.0
1             4583             1508.0       128.0             360.0
2             3000                0.0        66.0             360.0
3             2583             2358.0       120.0             360.0
4             6000                0.0       141.0             360.0

   Credit_History Property_Area Loan_Status
0             1.0         Urban           Y
1             1.0         Rural           N
2             1.0         Urban           Y
3             1.0         Urban           Y
4             1.0         Urban           Y

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv.csv'
df = pd.read_csv(file_path)

#Display the first 5 rows
print("First 5 rows:")
print(df.head())

First 5 rows:
   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked predicted embarked
0   330911   7.8292   NaN        Q                  Q
1   363272   7.0000   NaN        S                  S
2   240276   9.6875   NaN        Q                  Q
3   315154   8.6625   NaN        S                  S
4  3101298  12.2875   NaN        S                  S

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv.csv'
df = pd.read_csv(file_path)

#Display the last 3 rows
print("\nLast 3 rows:")
print(df.tail(3))

Last 3 rows:
     PassengerId  Survived  Pclass                          Name   Sex   Age  \
415         1307         0       3  Saether, Mr. Simon Sivertsen  male  38.5
416         1308         0       3           Ware, Mr. Frederick  male   NaN
417         1309         0       3      Peter, Master. Michael J  male   NaN

     SibSp  Parch              Ticket     Fare Cabin Embarked  \
415      0      0  SOTON/O.Q. 3101262   7.2500   NaN        S
416      0      0              359309   8.0500   NaN        S
417      1      1                2668  22.3583   NaN        C

    predicted embarked
415                NaN
416                NaN
417                NaN

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv.csv'
df = pd.read_csv(file_path)

#Show column names and data types
print("\nColumn names and data types:")
print(df.dtypes)

Column names and data types:
PassengerId             int64
Survived                int64
Pclass                  int64
Name                   object
Sex                    object
Age                   float64
SibSp                   int64
Parch                   int64
Ticket                 object
Fare                  float64
Cabin                  object
Embarked               object
predicted embarked     object
dtype: object

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv.csv'
df = pd.read_csv(file_path)

#Count missing values in each column
print("\nMissing values in each column:")
print(df.isnull().sum())

Missing values in each column:
PassengerId             0
Survived                0
Pclass                  0
Name                    0
Sex                     0
Age                    86
SibSp                   0
Parch                   0
Ticket                  0
Fare                    1
Cabin                 327
Embarked                0
predicted embarked    391
dtype: int64

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv.csv'
df = pd.read_csv(file_path)

#Get only the Name and Sex columns
print("Name and Sex columns:")
print(df[["Name", "Sex"]])

Name and Sex columns:
                                             Name     Sex
0                                Kelly, Mr. James    male
1                Wilkes, Mrs. James (Ellen Needs)  female
2                       Myles, Mr. Thomas Francis    male
3                                Wirz, Mr. Albert    male
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
..                                            ...     ...
413                            Spector, Mr. Woolf    male
414                  Oliva y Ocana, Dona. Fermina  female
415                  Saether, Mr. Simon Sivertsen    male
416                           Ware, Mr. Frederick    male
417                      Peter, Master. Michael J    male

[418 rows x 2 columns]

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv.csv'
df = pd.read_csv(file_path)

#Get the PassengerId, Name, and Fare columns of the first 10 rows
print("\nFirst 10 rows of PassengerId, Name, and Fare:")
print(df.loc[:9, ["PassengerId", "Name", "Fare"]])

First 10 rows of PassengerId, Name, and Fare:
   PassengerId                                          Name     Fare
0          892                              Kelly, Mr. James   7.8292
1          893              Wilkes, Mrs. James (Ellen Needs)   7.0000
2          894                     Myles, Mr. Thomas Francis   9.6875
3          895                              Wirz, Mr. Albert   8.6625
4          896  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  12.2875
5          897                    Svensson, Mr. Johan Cervin   9.2250
6          898                          Connolly, Miss. Kate   7.6292
7          899                  Caldwell, Mr. Albert Francis  29.0000
8          900     Abrahim, Mrs. Joseph (Sophie Halaut Easu)   7.2292
9          901                       Davies, Mr. John Samuel  24.1500

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv.csv'
df = pd.read_csv(file_path)

#Select all rows where Pclass = 1
print("\nRows where Pclass = 1:")
print(df[df["Pclass"] == 1])

Rows where Pclass = 1:
     PassengerId  Survived  Pclass  \
11           903         0       1
12           904         1       1
14           906         1       1
20           912         0       1
22           914         1       1
..           ...       ...     ...
403         1295         0       1
404         1296         0       1
407         1299         0       1
411         1303         1       1
414         1306         1       1

                                                  Name     Sex   Age  SibSp  \
11                          Jones, Mr. Charles Cresson    male  46.0      0
12       Snyder, Mrs. John Pillsbury (Nelle Stevenson)  female  23.0      1
14   Chaffee, Mrs. Herbert Fuller (Carrie Constance...  female  47.0      1
20                              Rothschild, Mr. Martin    male  55.0      1
22                Flegenheim, Mrs. Alfred (Antoinette)  female   NaN      0
..                                                 ...     ...   ...    ...
403                             Carrau, Mr. Jose Pedro    male  17.0      0
404                       Frauenthal, Mr. Isaac Gerald    male  43.0      1
407                         Widener, Mr. George Dunton    male  50.0      1
411    Minahan, Mrs. William Edward (Lillian E Thorpe)  female  37.0      1
414                       Oliva y Ocana, Dona. Fermina  female  39.0      0

     Parch       Ticket      Fare Cabin Embarked predicted embarked
11       0          694   26.0000   NaN        S                  S
12       0        21228   82.2667   B45        S                  S
14       0  W.E.P. 5734   61.1750   E31        S                  S
20       0     PC 17603   59.4000   NaN        C                  C
22       0     PC 17598   31.6833   NaN        S                  S
..     ...          ...       ...   ...      ...                ...
403      0       113059   47.1000   NaN        S                NaN
404      0        17765   27.7208   D40        C                NaN
407      1       113503  211.5000   C80        C                NaN
411      0        19928   90.0000   C78        Q                NaN
414      0     PC 17758  108.9000  C105        C                NaN

[107 rows x 13 columns]

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv.csv'
df = pd.read_csv(file_path)

#Select all rows where Sex = 'female' and Survived = 1
print("\nRows where female passengers survived:")
print(df[(df["Sex"] == "female") & (df["Survived"] == 1)])

Rows where female passengers survived:
     PassengerId  Survived  Pclass  \
1            893         1       3
4            896         1       3
6            898         1       3
8            900         1       3
12           904         1       1
..           ...       ...     ...
409         1301         1       3
410         1302         1       3
411         1303         1       1
412         1304         1       3
414         1306         1       1

                                                Name     Sex   Age  SibSp  \
1                   Wilkes, Mrs. James (Ellen Needs)  female  47.0      1
4       Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1
6                               Connolly, Miss. Kate  female  30.0      0
8          Abrahim, Mrs. Joseph (Sophie Halaut Easu)  female  18.0      0
12     Snyder, Mrs. John Pillsbury (Nelle Stevenson)  female  23.0      1
..                                               ...     ...   ...    ...
409                        Peacock, Miss. Treasteall  female   3.0      1
410                           Naughton, Miss. Hannah  female   NaN      0
411  Minahan, Mrs. William Edward (Lillian E Thorpe)  female  37.0      1
412                   Henriksson, Miss. Jenny Lovisa  female  28.0      0
414                     Oliva y Ocana, Dona. Fermina  female  39.0      0

     Parch              Ticket      Fare Cabin Embarked predicted embarked
1        0              363272    7.0000   NaN        S                  S
4        1             3101298   12.2875   NaN        S                  S
6        0              330972    7.6292   NaN        Q                  Q
8        0                2657    7.2292   NaN        C                  C
12       0               21228   82.2667   B45        S                  S
..     ...                 ...       ...   ...      ...                ...
409      1  SOTON/O.Q. 3101315   13.7750   NaN        S                NaN
410      0              365237    7.7500   NaN        Q                NaN
411      0               19928   90.0000   C78        Q                NaN
412      0              347086    7.7750   NaN        S                NaN
414      0            PC 17758  108.9000  C105        C                NaN

[152 rows x 13 columns]

In [ ]:
import pandas as pd

file_path = '/content/drive/MyDrive/Titanicdataset.csv.csv'
df = pd.read_csv(file_path)

#Select the Age of passengers whose Fare > 100
print("\nAge of passengers with Fare > 100:")
print(df.loc[df["Fare"] > 100, "Age"])

Age of passengers with Fare > 100:
24     48.0
53     28.0
59     36.0
64     13.0
69     60.0
74     35.0
75     32.5
81     67.0
114    63.0
141    33.0
142    61.0
156    29.0
184    27.0
196     6.0
202    47.0
217    57.0
218    50.0
239    48.0
242    45.0
252    27.0
272    26.0
306    30.0
314    55.0
316    57.0
324    39.0
343    58.0
371    31.0
375    45.0
400    30.0
407    50.0
414    39.0
Name: Age, dtype: float64